Autodesk.Revit.DB.AXMImportOptions.CreateMassfloors
Indicate if mass floors are to be created.
False by default.
Make sure that levels have been created before open this option.
Or you can set importLevels true at the same time.
Since:
2022.1

Autodesk.Revit.DB.AXMImportOptions.ImportLevels
Indicate if levels are to be imported.
False by default.
Since:
2022.1

Autodesk.Revit.DB.AXMImportOptions.#ctor(Autodesk.Revit.DB.AXMImportOptions)
Constructs a new instance of AXMImportOptions as a copy of the provided import options.
option:
The AXM import options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022.1

Autodesk.Revit.DB.AXMImportOptions.#ctor
Constructs a new instance of AXMImportOptions with default values of all properties.
Since:
2022.1

Autodesk.Revit.DB.AXMImportOptions
The import options used to import AXM format files.
Since:
2022.1